/*
 * 版权信息: © 聚均科技
 */
package work.xingbili.common.enums;

/**
 * 影像节点枚举
 * 
 * @author yangfan
 * @date 2021/07/29
 */
public enum BusiFileTypeEnum {
    M1010502("1010502", "客户基础资料-营业执照"),
    M1010508("1010508", "客户基础资料-法人身份证及用户身份证原件复印件"),
    M1010514("1010514", "客户基础资料-管理员身份证原件复印件"),
    M1010510("1010510", "客户基础资料-财务报表"),
    M9790085("9790085", "业务申请-日照银行橙信合作协议"),
    M9790086("9790086", "业务申请-付款承诺函"), 
    M9790087("9790087", "业务申请-橙信开立单"), 
    M9790088("9790088", "业务申请-橙信流转单"),
    M9790089("9790089", "业务申请-合同附件"), 
    M9790090("9790090", "业务申请-发票附件"), 
    M9790091("9790091", "业务申请-企业征信查询授权书"),
    M9790093("9790093", "(顺和)业务申请-回购通知书"),
    M9790094("9790094", "(顺和)业务申请-企业信用报告查询授权书"),
    M9790095("9790095", "(顺和)业务申请-贸易合同"),
    M4100411("4100411", "(顺和)出账申请-支付委托书"),
    M410041201("410041201", "(顺和)企业平台用款申请-监管物品确认书"),
    M410041301("410041301", "(顺和)企业平台用款申请-收押凭据"),
    M410041202("410041202", "(顺和)企业平台用款申请-提货通知书回执"),
    MSH001001("sh001001", "(顺和)金融产品审批通过-企业信用报告查询授权书"),
    MSH001002("sh001002", "(顺和)金融产品审批通过-客户画像资料"),
//    MH001("mh001", "电子债权凭证节点目录（反向保理）"), 
//    MH00101("mh00101", "电子债权凭证"),
//    MH00102("mh00102", "反向保理（场景化）"),
    ;
    private String code;
    private String info;

    private BusiFileTypeEnum(String code, String info) {
        this.code = code;
        this.info = info;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getInfo() {
        return info;
    }

    public void setInfo(String info) {
        this.info = info;
    }
}
